# Final assignement: Databases and SQL for Data Science with Python
## Import of libraries and database connection
#### NB: I can't use cloud database on my computer so i will use sqlite3 on a local database

In [1]:
import sqlite3
import pandas as pd
conn = sqlite3.connect('database.db')

## Question 1: Find the total number of crimes recorded in the CRIME table

In [36]:
df = pd.read_sql_query("select count(*) as 'Total number of crimes' from Crimes", conn)
df

   Total number of crimes
0                 7689884

## Question 2: List community areas with per capita income less than 11000

In [37]:
df = pd.read_sql_query("select CommunityAreaName as 'List community areas with per capita income' from Census_Data where PERCAPITAINCOME < 11000", conn)
df

  List community areas with per capita income
0                          West Garfield Park
1                              South Lawndale
2                                 Fuller Park
3                                   Riverdale

## Question 3: List all case numbers for crimes  involving minors?(children are not considered minors for the purposes of crime analysis)

In [39]:
df = pd.read_sql_query("select Description as 'Crime', count(*) as 'Numbers' from Crimes where Description like '%BY MINOR%' or  Description like '%TO MINOR%' group by Description;", conn)
df

                                         Crime  Numbers
0                 ILLEGAL CONSUMPTION BY MINOR     4671
1                  ILLEGAL POSSESSION BY MINOR     3230
2  SALE / DISTRIBUTE OBSCENE MATERIAL TO MINOR       38
3            SALE OF TOBACCO PRODUCTS TO MINOR        3
4               SALE TOBACCO PRODUCTS TO MINOR       30
5               SALE/DIST OBSCENE MAT TO MINOR      140
6        SELL / GIVE / DELIVER LIQUOR TO MINOR       46
7                SELL/GIVE/DEL LIQUOR TO MINOR     3196

## Question 4: List all kidnapping crimes involving a child?

In [40]:
df = pd.read_sql_query("select PrimaryType as 'Crime', Description as 'Description', count(*) as 'Numbers' from Crimes where Description like '%child%' and PrimaryType like '%kidnapping' group by Description;", conn)
df

        Crime                 Description  Numbers
0  KIDNAPPING  CHILD ABDUCTION / STRANGER       76
1  KIDNAPPING    CHILD ABDUCTION/STRANGER     2461

### Question 5: What kind of crimes were recorded at schools?

In [34]:
df = pd.read_sql_query("select PrimaryType as 'Crime', count(*) as 'Numbers' from Crimes where LocationDescription like '%school%' group by PrimaryType;", conn)
df

                                Crime  Numbers
0                               ARSON      276
1                             ASSAULT    32890
2                             BATTERY    68855
3                            BURGLARY     3312
4   CONCEALED CARRY LICENSE VIOLATION        6
5                 CRIM SEXUAL ASSAULT      450
6                     CRIMINAL DAMAGE    14158
7             CRIMINAL SEXUAL ASSAULT       98
8                   CRIMINAL TRESPASS     8059
9                  DECEPTIVE PRACTICE     1488
10                           GAMBLING      232
11                           HOMICIDE       17
12                  HUMAN TRAFFICKING        1
13   INTERFERENCE WITH PUBLIC OFFICER      110
14                       INTIMIDATION      254
15                         KIDNAPPING      219
16               LIQUOR LAW VIOLATION      422
17                MOTOR VEHICLE THEFT      671
18                          NARCOTICS    12452
19                          OBSCENITY       97
20         OFFENSE INVOLVING CHILDREN     1621
21           OTHER NARCOTIC VIOLATION       18
22                      OTHER OFFENSE     4837
23                       PROSTITUTION       15
24                   PUBLIC INDECENCY        8
25             PUBLIC PEACE VIOLATION     5637
26                          RITUALISM        3
27                            ROBBERY     1754
28                        SEX OFFENSE     1920
29                           STALKING      114
30                              THEFT    35985
31                  WEAPONS VIOLATION     5570

### Question 6: List the average safety score for all types of schools.

In [41]:
df = pd.read_sql_query("select ElementaryMiddleorHighSchool as 'Types of schools', AVG(SafetyScore) as 'avg Safety Score' from Chicago_Public_Schools group by ElementaryMiddleorHighSchool;", conn)
df

  Types of schools  avg Safety Score
0               ES         49.520384
1               HS         49.623529
2               MS         48.000000

### Question 7: List 5 community areas with highest % of households below poverty line.

In [44]:
df = pd.read_sql_query("select COMMUNITYAREANAME as 'Community area', PERCENTHOUSEHOLDSBELOWPOVERTY  as '% below poverty' from Census_Data order by PERCENTHOUSEHOLDSBELOWPOVERTY desc limit(5);", conn)
df

       Community area  % below poverty
0           Riverdale             56.5
1         Fuller Park             51.2
2           Englewood             46.6
3      North Lawndale             43.1
4  East Garfield Park             42.4

### Question 8: Which community area(number) is most crime prone?

In [74]:
df = pd.read_sql_query("SELECT CommunityArea as 'Community number', count(*) as 'Crime_numbers' FROM Crimes where CommunityArea NOT NULL group by CommunityArea order by 2 desc limit(1);", conn)
df

   Community number  Crime_numbers
0                25         443727

### Question 9: Use a sub-query to find the name of the community area with highest hardship index.

In [70]:
df = pd.read_sql_query("SELECT COMMUNITYAREANAME as 'Community name' , HARDSHIPINDEX as 'HARD SHIP INDEX' FROM Census_Data where HARDSHIPINDEX = (select max(HARDSHIPINDEX) FROM Census_Data);", conn)
df

  Community name  HARD SHIP INDEX
0      Riverdale               98

### Question 10: Use a sub-query to determine the Community Area Name with most number of crimes?

In [77]:
df = pd.read_sql_query("SELECT COMMUNITYAREANAME as 'Community name', CommunityArea as 'Community number', max(Number_crime) FROM" 
                       "(select COMMUNITYAREANAME, CommunityArea, count(*) as Number_crime FROM Crimes, Census_Data where Crimes.CommunityArea NOT NULL AND Census_Data.CommunityAreaNumber = Crimes.CommunityArea group by CommunityArea);", conn)
df

  Community name  Community number  max(Number_crime)
0         Austin                25             443727